/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   echo.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: dham <dham@student.42seoul.kr>             +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/09/01 20:38:59 by dham              #+#    #+#             */
/*   Updated: 2022/12/19 16:16:55 by dham             ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "ft_builtin.h"
#include <stdio.h>

int	ft_echo(int nl, char *str)
{
	printf("%s", str); // 널문자 뒤뒤도  ㅍ출력해야됨 ㅇㅣ제ㄴ아님
	if (nl)
		printf("\n");
	return (0);
}